In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import plotly.express as px
import scipy.stats as st 
import openpyxl as ox

In [3]:
Fd = pd.read_excel(r"C:\python\JUPYTER\swiggy_analysis\Raw Dataset\food.xlsx")
Mn = pd.read_excel(r"C:\python\JUPYTER\swiggy_analysis\Raw Dataset\menu.xlsx")
Od = pd.read_excel(r"C:\python\JUPYTER\swiggy_analysis\Raw Dataset\orders.xlsx")
Ot = pd.read_excel(r"C:\python\JUPYTER\swiggy_analysis\Raw Dataset\orders_type.xlsx")
Rt = pd.read_excel(r"C:\python\JUPYTER\swiggy_analysis\Raw Dataset\restaurant.xlsx")
Ur = pd.read_excel(r"C:\python\JUPYTER\swiggy_analysis\Raw Dataset\users.xlsx")

In [11]:
Fd.head() #food

  f_id                  item veg_or_non_veg
0  fd0     Aloo Tikki Burger            Veg
1  fd1     Veg Creamy Burger            Veg
2  fd2   Cheese Burst Burger            Veg
3  fd3  Paneer Creamy Burger            Veg
4  fd4        Maxican Burger            Veg

In [12]:
Mn.head() #menu

  menu_id    r_id      f_id           cuisine  price
0     mn0  567335       fd0  Beverages,Pizzas   40.0
1     mn0  567335  fd669322  Beverages,Pizzas   40.0
2   mn328  158203       fd0         Beverages   65.0
3   mn328  158203  fd669322         Beverages   65.0
4   mn449  158203       fd0         Beverages   65.0

In [13]:
Od.head() #orders

  order_date  sales_qty  sales_amount currency  user_id      r_id
0 2017-10-10        100         41241      INR    49226  567335.0
1 2018-05-08          3            -1      INR    77359  531342.0
2 2018-04-06          1           875      INR     5321  158203.0
3 2018-04-11          1           583      INR    21343  187912.0
4 2018-06-18          6          7176      INR    75378  543530.0

In [14]:
Ot.head() #order type

     Order_Id     Type
0  B496840219  Non-Veg
1  C134461623    Other
2  D679770099    Other
3  E622201871      Veg
4  A980473889  Non-Veg

In [15]:
Rt.head() #restaurant

,id,name,Country,city,rating,rating_count,cuisine,link,address
0,567335,AB FOODS POINT,India,Abohar,--,Too Few Ratings,"Beverages,Pizzas",https://www.swiggy.com/restaurants/ab-foods-po...,"AB FOODS POINT, NEAR RISHI NARANG DENTAL CLINI..."
1,531342,Janta Sweet House,India,Abohar,4.4,50+ ratings,"Sweets,Bakery",https://www.swiggy.com/restaurants/janta-sweet...,"Janta Sweet House, Bazar No.9, Circullar Road,..."
2,158203,theka coffee desi,India,Abohar,3.8,100+ ratings,Beverages,https://www.swiggy.com/restaurants/theka-coffe...,"theka coffee desi, sahtiya sadan road city"
3,187912,Singh Hut,India,Abohar,3.7,20+ ratings,"Fast Food,Indian",https://www.swiggy.com/restaurants/singh-hut-n...,"Singh Hut, CIRCULAR ROAD NEAR NEHRU PARK ABOHAR"
4,543530,GRILL MASTERS,India,Abohar,--,Too Few Ratings,"Italian-American,Fast Food",https://www.swiggy.com/restaurants/grill-maste...,"GRILL MASTERS, ADA Heights, Abohar - Hanumanga..."

In [16]:
Ur.head() #users

   user_id               name  Age  Gender Marital Status Occupation
0        1    Claire Ferguson   20  Female         Single    Student
1        2     Jennifer Young   24  Female         Single    Student
2        3  Jermaine Roberson   22    Male         Single    Student
3        4   Rachel Carpenter   22  Female         Single    Student
4        5       Shawn Parker   22    Male         Single    Student

In [17]:
Datasets = [Fd, Mn, Od, Ot, Rt, Ur]
for i in Datasets:
    print(i.dtypes, "\n")

f_id              object
item              object
veg_or_non_veg    object
dtype: object

menu_id     object
r_id         int64
f_id        object
cuisine     object
price      float64
dtype: object

order_date      datetime64[ns]
sales_qty                int64
sales_amount             int64
currency                object
user_id                  int64
r_id                   float64
dtype: object

Order_Id    object
Type        object
dtype: object

id               int64
name            object
Country         object
city            object
rating          object
rating_count    object
cuisine         object
link            object
address         object
dtype: object

user_id            int64
name              object
Age                int64
Gender            object
Marital Status    object
Occupation        object
dtype: object

## for food

In [20]:
Fd.isnull().sum()

f_id              8
item              8
veg_or_non_veg    8
dtype: int64

In [21]:
Fd[Fd["f_id"].isnull()]

       f_id item veg_or_non_veg
13540   NaN  NaN            NaN
99966   NaN  NaN            NaN
99988   NaN  NaN            NaN
99989   NaN  NaN            NaN
99991   NaN  NaN            NaN
99993   NaN  NaN            NaN
99994   NaN  NaN            NaN
166711  NaN  NaN            NaN

In [22]:
Fd.dropna(inplace=True)

In [23]:
Fd.isnull().sum()

f_id              0
item              0
veg_or_non_veg    0
dtype: int64

## For Menu

In [24]:
Mn.isnull().sum()

menu_id    0
r_id       0
f_id       0
cuisine    0
price      1
dtype: int64

In [25]:
Mn[Mn['price'].isnull()]

         menu_id    r_id      f_id       cuisine  price
878051  mn414862  496987  fd413746  South Indian    NaN

In [26]:
#droping the null value
Mn.dropna(inplace=True)

In [27]:
Mn.isnull().sum()

menu_id    0
r_id       0
f_id       0
cuisine    0
price      0
dtype: int64

In [28]:
Mn.isnull().sum().any()

np.False_

## For Orders

In [60]:
Od.isnull().sum()

order_date         0
sales_qty          0
sales_amount       0
currency           0
user_id            0
r_id            1617
dtype: int64

In [61]:
# Count the Null Values.
Cnt_Null_Orders = Od["r_id"].isnull().sum()
Cnt_Null_Orders

np.int64(1617)

In [62]:
Null_Value_Per = (Cnt_Null_Orders / len(Od) ) * 100
Null_Value_Per

np.float64(1.0759843227021382)

In [63]:
# 1.07 Percent of data is null in orders table.
# Print the Rows That have Null Values.
Od[Od["r_id"].isnull()].head()

       order_date  sales_qty  sales_amount currency  user_id  r_id
148664 2019-03-19          1          1625      INR    50862   NaN
148665 2019-03-19          1          1741      INR    25120   NaN
148666 2019-03-20          1          1463      INR    84260   NaN
148667 2019-03-20          1          2949      INR    14329   NaN
148668 2019-03-21          1          1241      INR    38858   NaN

In [64]:
# We can't lose the 1% of data because the other columns' data is important.
# We can handle it in Power BI.
# We will use a filter to hide the blank values from the visualization.

## for Restaurant

In [65]:
Rt.isnull().sum()

id              0
name            0
Country         0
city            0
rating          0
rating_count    0
cuisine         0
link            0
address         0
dtype: int64

In [66]:
Rt[Rt["name"].isnull()].head()

Empty DataFrame
Columns: [id, name, Country, city, rating, rating_count, cuisine, link, address]
Index: []

In [67]:
Null_Restaurant_id = Rt[Rt["name"].isnull()]["id"]
Null_Restaurant_id

Series([], Name: id, dtype: int64)

In [68]:
#Count of Null Values
Count_of_Null_Rest = len(Null_Restaurant_id)
Count_of_Null_Rest

0

In [69]:
# Get the Details of the Orders Table where the Restaurant IDs have Null values.
Od[Od["r_id"].isin(Null_Restaurant_id)].head()

Empty DataFrame
Columns: [order_date, sales_qty, sales_amount, currency, user_id, r_id]
Index: []

In [70]:
# There is No relationship Betweent the Null Values of R_Id in Orders Table and Restaurant Table
# Calculat the Percentage of Null Values in Restaurant Table
Cnt_Null_Percent = (Count_of_Null_Rest / len(Rt) ) * 100
Cnt_Null_Percent

0.0

In [71]:
# Null Values are 0.05 Percent of total Restaurant Values
# We Can Drop these Null Values
# Remove The Null Values from the Restaurant Dataset
Rt.dropna(subset="name",inplace=True)

In [72]:
# After Droping Null Values, Count the Entries in The Restaurant Table
len(Rt)

148454

In [73]:
# Before there was 148540 Rows
# Now it is 148454 Rows

In [74]:
# Re-Analyse the Null Values in Restaurant Table
Rt.isnull().sum()

id              0
name            0
Country         0
city            0
rating          0
rating_count    0
cuisine         0
link            0
address         0
dtype: int64

In [75]:
# Still Cuisine Have 13 Null Values
n = Rt["cuisine"].isnull().sum()
Rt[Rt["cuisine"].isnull()].head(n)

Empty DataFrame
Columns: [id, name, Country, city, rating, rating_count, cuisine, link, address]
Index: []

In [76]:
# Analyse the Number of Unique Values in "Cuisine" Column
Rt["cuisine"].nunique()

2132

In [77]:
# Print the Most Repeated "Cuisine" Value using Mode Function.
Most_Repeated_Cuisine = Rt["cuisine"].mode()
Most_Repeated_Cuisine

0    North Indian,Chinese
Name: cuisine, dtype: object

In [78]:
# Most Repeated Cuisine is "North Indian & Chinese"
# Analyse the Number of Values which Have Most Repeated Cuisine.
len(Rt[Rt["cuisine"].isin(Most_Repeated_Cuisine)])

6484

In [79]:
# Almost 6471 Restaurant have "North Indian & Chinese" Cuisine
Most_Repeated_Cuisine[0]

'North Indian,Chinese'

In [80]:
Rt["cuisine"].fillna(Most_Repeated_Cuisine[0], inplace=True)
# filling where cuisine is null

In [81]:
# Check one of the Filled Value
Rt[Rt["id"] == 62718]

,id,name,Country,city,rating,rating_count,cuisine,link,address
52218,62718,34 Chowringhee Lane,India,"Ashok Vihar,Delhi",3.6,100+ ratings,"North Indian,Chinese",https://www.swiggy.com/restaurants/34-chowring...,"34 Chowringhee Lane, Shop no. 2, Phase 1, J bl..."

In [82]:
Rt.isnull().sum()

id              0
name            0
Country         0
city            0
rating          0
rating_count    0
cuisine         0
link            0
address         0
dtype: int64

In [83]:
# Good to go

## For Order Types

In [84]:
Ot.isnull().sum()

Order_Id    0
Type        0
dtype: int64

## For Users

In [85]:
Ur.isnull().sum()

user_id           0
name              0
Age               0
Gender            0
Marital Status    0
Occupation        0
dtype: int64

# Table Formating

In [86]:
Fd.columns

Index(['f_id', 'item', 'veg_or_non_veg'], dtype='object')

In [87]:
# Renaming the columns
Fd.rename(columns={"f_id":"Food_id","veg_or_non_veg":"Food_Type","item":"Item"},inplace=True)
Fd.columns

Index(['Food_id', 'Item', 'Food_Type'], dtype='object')

In [88]:
Mn.columns

Index(['menu_id', 'r_id', 'f_id', 'cuisine', 'price'], dtype='object')

In [90]:
# Renaming the columns
Mn.rename(columns={"menu_id":"Menu_id","r_id":"Restaurant_id",
                     "f_id":"Food_id","cuisine":"Cuisine","price":"Price"}, inplace=True)
Mn.columns

Index(['Menu_id', 'Restaurant_id', 'Food_id', 'Cuisine', 'Price'], dtype='object')

In [92]:
Od.columns

Index(['order_date', 'sales_qty', 'sales_amount', 'currency', 'user_id',
       'r_id'],
      dtype='object')

In [96]:
Od.rename(columns={"order_Date":"Order_date","sales_qty":"Sales_QTY","sales_amount":"Sales_amount",
                       "Currency":"Currency","user_id":"User_id","r_id":"Restaurant_id"}, inplace=True)
Od.columns

Index(['order_date', 'Sales_QTY', 'Sales_amount', 'currency', 'User_id',
       'Restaurant_id'],
      dtype='object')

In [97]:
Rt.columns

Index(['Restaurant_id', 'Name', 'Country', 'City', 'Rating', 'Rating_count',
       'Cuisine', 'Link', 'Address'],
      dtype='object')

In [98]:
Rt.rename(columns={"id":"Restaurant_id","name":"Name","city":"City",
                           "rating":"Rating","rating_count":"Rating_count","cuisine":"Cuisine","link":"Link","address":"Address"},
                           inplace=True)
Rt.columns

Index(['Restaurant_id', 'Name', 'Country', 'City', 'Rating', 'Rating_count',
       'Cuisine', 'Link', 'Address'],
      dtype='object')

In [99]:
Ur.columns

Index(['user_id', 'name', 'Age', 'Gender', 'Marital Status', 'Occupation'], dtype='object')

In [100]:
Ur.rename(columns={"user_id":"User_id","name":"Name"}, inplace=True)
Ur.columns

Index(['User_id', 'Name', 'Age', 'Gender', 'Marital Status', 'Occupation'], dtype='object')

In [101]:
# Drop the Un_neccesary column from the restaurant table
Rt.drop(columns=["Link","Address"], axis=1, inplace=True)

In [102]:
Rt.head()

,Restaurant_id,Name,Country,City,Rating,Rating_count,Cuisine
0,567335,AB FOODS POINT,India,Abohar,--,Too Few Ratings,"Beverages,Pizzas"
1,531342,Janta Sweet House,India,Abohar,4.4,50+ ratings,"Sweets,Bakery"
2,158203,theka coffee desi,India,Abohar,3.8,100+ ratings,Beverages
3,187912,Singh Hut,India,Abohar,3.7,20+ ratings,"Fast Food,Indian"
4,543530,GRILL MASTERS,India,Abohar,--,Too Few Ratings,"Italian-American,Fast Food"

In [103]:
# Delete the Orders_type Table 's DataFrame
del Ot

In [105]:
# Delete the Orders_Type file from the system
import os
path = r"C:\python\JUPYTER\swiggy_analysis\Raw Dataset\orders_type.xlsx"

try:
    os.remove(path)
except Exception as e:
    print(e)

[WinError 2] The system cannot find the file specified: 'C:\\python\\JUPYTER\\swiggy_analysis\\Raw Dataset\\orders_type.xlsx'

# storing the files into filtered data

In [107]:
# Store the Cleaned and Processed Data into the System.
Fd.to_csv(r"C:\python\JUPYTER\swiggy_analysis\filtered data\Food.csv", index=False)
Mn.to_csv(r"C:\python\JUPYTER\swiggy_analysis\filtered data\Menu.csv", index=False)
Od.to_csv(r"C:\python\JUPYTER\swiggy_analysis\filtered data\Orders.csv", index=False)
Rt.to_csv(r"C:\python\JUPYTER\swiggy_analysis\filtered data\Restaurant.csv", index=False)
Ur.to_csv(r"C:\python\JUPYTER\swiggy_analysis\filtered data\Users.csv", index=False)